app/views/users/show.html.erb

    <div class="col-md-8">
      <% if @user.leads.any? %>
        <h3>Leads (<%= @user.leads.count %>)</h3>
---
SELECT  1 AS one FROM "leads" WHERE "leads"."user_id" = ? LIMIT ?  [["user_id", 12], ["LIMIT", 1]]
SELECT "leads".* FROM "leads" WHERE "leads"."user_id" = ? ORDER BY "leads"."created_at" DESC  [["user_id", 15]]
SELECT COUNT(*) FROM "leads" WHERE "leads"."user_id" = ?  [["user_id", 12]]