app/views/shared/_user_info.html.erb

<span><%= link_to "view my profile", current_user %></span>
<span><%= pluralize(current_user.leads.count, "Lead") %></span>
---
SELECT COUNT(*) FROM "leads" WHERE "leads"."user_id" = ?  [["user_id", 15]]