app/controllers/dashboards_controller.rb

SELECT COUNT(*) FROM "leads" WHERE "leads"."user_id" = ?  [["user_id", 14]]
---
  def show_user_dashboard
  	@lead = current_user.leads.all
  	@lead_count = @lead.count