app/controllers/landing_pages_controller.rb

SELECT "landing_pages".* FROM "landing_pages" WHERE "landing_pages"."user_id" = ? ORDER BY "landing_pages"."created_at" DESC  [["user_id", 15]]
SELECT COUNT(*) FROM "landing_pages" WHERE "landing_pages"."user_id" = ?  [["user_id", 15]]
---
	def index
		@landing_pages = current_user.landing_pages.all

INSERT INTO "landing_pages" ("name", "logo", "banner_image", "about_description", "section_1_image", "section_2_image", "section_1_content", "section_2_content", "video_url", "section_3_icon_1", "section_3_icon_2", "section_3_icon_3", "gallery_img_1", "gallery_img_2", "gallery_img_3", "gallery_img_4", "gallery_img_5", "gallery_img_6", "gallery_img_7", "gallery_img_8", "gallery_img_9", "gallery_img_10", "testimonial_content_1", "testimonial_content_2", "created_at", "updated_at", "user_id", "testimonial_1_name", "testimonial_2_name", "section_3_description_1", "section_3_description_2", "section_3_description_3", "custom_url") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@landing_page = current_user.landing_pages.build(landing_page_params)

  	if @landing_page.save

SELECT  "landing_pages".* FROM "landing_pages" WHERE "landing_pages"."id" = ? ORDER BY "landing_pages"."created_at" DESC LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	def edit
		@landing_page = LandingPage.find(params[:id])

SELECT  "landing_pages".* FROM "landing_pages" WHERE "landing_pages"."user_id" = ? AND "landing_pages"."id" = ? ORDER BY "landing_pages"."created_at" DESC LIMIT ?  [["user_id", 15], ["id", 4], ["LIMIT", 1]]
---
	def show
		@landing_page = current_user.landing_pages.find(params[:id])

SELECT  "landing_pages".* FROM "landing_pages" WHERE "landing_pages"."id" = ? ORDER BY "landing_pages"."created_at" DESC LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "landing_pages" SET "logo" = ?, "banner_image" = ?, "section_1_image" = ?, "section_2_image" = ?, "video_url" = ?, "section_3_icon_1" = ?, "section_3_icon_2" = ?, "section_3_icon_3" = ?, "our_client_logo_1" = ?, "our_client_logo_2" = ?, "our_client_logo_3" = ?, "our_client_logo_4" = ?, "our_client_logo_5" = ?, "updated_at" = ? WHERE "landing_pages"."id" = ?
---
	def update
		@landing_page = LandingPage.find(params[:id])
		if @landing_page.update_attributes(landing_page_params)

DELETE FROM "landing_pages" WHERE "landing_pages"."id" = ?  [["id", 11]]
SELECT  "landing_pages".* FROM "landing_pages" WHERE "landing_pages"."id" = ? ORDER BY "landing_pages"."created_at" DESC LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
	def destroy
		LandingPage.find(params[:id]).destroy

SELECT  "landing_pages".* FROM "landing_pages" WHERE "landing_pages"."id" = ? ORDER BY "landing_pages"."created_at" DESC LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
	def render_page
		# @masked_leads = []
  #     @verified_leads = VerifiedLeads.all
  #     @verified_leads.each do |i|
  #        @masked_lead = {
  #         "id": i.id,
  #         "name": (i.name[0,4]).ljust(10, "*"),
  #         "phone_number": ((i.phone_number).to_s[0,5]).ljust(10, "*"),
  #         "email": (i.email[0,4]).ljust(10, "*"),
  #         "preferred_unit_type": i.preferred_unit_type,
  #         "preferred_location": i.preferred_location,
  #         "budget": i.budget,
  #         "additional_description": i.additional_description,
  #         "credit": i.credit,
  #         "created_at": i.created_at
  #        }
  #        @masked_leads << @masked_lead
  #     end
  #     render json: ["masked_leads": @masked_leads], status: 200
  	# @section_1 = []
  @landing_page = LandingPage.find(params[:id])