app/controllers/leads_controller.rb

DELETE FROM "leads" WHERE "leads"."id" = ?  [["id", 34]]
---
def destroy
  @lead = Lead.find(params[:id])
  @lead.destroy