app/controllers/leads_controller.rb

SELECT DISTINCT "leads"."category" FROM "leads" WHERE "leads"."user_id" = ? ORDER BY "leads"."created_at" DESC  [["user_id", 15]]
SELECT DISTINCT "leads"."city" FROM "leads" WHERE "leads"."user_id" = ? ORDER BY "leads"."created_at" DESC  [["user_id", 15]]
SELECT "leads"."phone_number" FROM "leads" WHERE "leads"."user_id" = ? AND "leads"."category" = ? AND "leads"."city" = ? ORDER BY "leads"."created_at" DESC  [["user_id", 15], ["category", "Computers and Electronics"], ["city", "Tirunelveli"]]
SELECT "leads".* FROM "leads" WHERE "leads"."user_id" = ? AND "leads"."category" = ? AND "leads"."city" = ? ORDER BY "leads"."created_at" DESC  [["user_id", 15], ["category", "Sports"], ["city", "Hyderabad"]]
---
def index
  # @lead = current_user.leads

  # pluck city and category
  @leads_category = current_user.leads.distinct.pluck(:category)
  @leads_city = current_user.leads.distinct.pluck(:city)

  # post sms
  @result = []
    if params[:category] && params[:city] && params[:message]
      @spydy_sms = current_user.leads.where({:category => params[:category], :city => params[:city]}).pluck(:phone_number)

      spydy_sms_numbers = @spydy_sms.join(', ')

INSERT INTO "leads" ("name", "email", "phone_number", "category", "city", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
def create
	@lead = current_user.leads.build(lead_params)
  if @lead.save

SELECT  "leads".* FROM "leads" WHERE "leads"."user_id" = ? AND "leads"."id" = ? ORDER BY "leads"."created_at" DESC LIMIT ?  [["user_id", 15], ["id", 103], ["LIMIT", 1]]
---
def show
  @lead = current_user.leads.find(params[:id])

SELECT  "leads".* FROM "leads" WHERE "leads"."id" = ? ORDER BY "leads"."created_at" DESC LIMIT ?  [["id", 102], ["LIMIT", 1]]
---
def edit
   @lead = Lead.find(params[:id])

INSERT INTO "leads" ("name", "email", "phone_number", "category", "city", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
def update
  @lead = current_user.leads.build(lead_params)
  if @lead.save

SELECT  "leads".* FROM "leads" WHERE "leads"."id" = ? ORDER BY "leads"."created_at" DESC LIMIT ?  [["id", 65], ["LIMIT", 1]]
DELETE FROM "leads" WHERE "leads"."id" = ?  [["id", 103]]
---
def destroy
  @lead = Lead.find(params[:id])
  @lead.destroy