app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty?                  # Case (3)
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)          # Case (4)
      log_in @user
      @user.update_attribute(:reset_digest, nil)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$cAjXEBYSkuGcw..2bIo8humaY.YO4EPYXU5w5rte0kA3q6E2rT8i."], ["updated_at", "2019-06-20 06:50:51.961033"], ["id", 15]]
UPDATE "users" SET "reset_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["reset_digest", nil], ["updated_at", "2019-06-20 06:55:37.974509"], ["id", 15]]

    def get_user
      @user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "karthikeyan@spinircle.com"], ["LIMIT", 1]]