app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."activated" = ?  [["activated", 1]]
---
  def index
    @users = User.where(activated: true)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Karthikeyankkn"], ["updated_at", "2019-06-19 08:59:47.603073"], ["id", 12]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)