app/models/lead.rb

INSERT INTO "leads" ("name", "email", "phone_number", "category", "city", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def self.import(file)
    CSV.foreach(file.path, headers: true) do |row|
      # avoid duplication for csv lead upload
      # lead_check = Lead.where(phone_number: row.to_hash["phone_number"])
      # if lead_check.length == 0
      #   Lead.create! row.to_hash
      # end
      Lead.create! row.to_hash